---
kind: type
id: T:Autodesk.Revit.DB.FilterElement
source: html/909615cd-8abd-044a-cff2-f21fd95b8ee7.htm
---
# Autodesk.Revit.DB.FilterElement

The base class for filter elements in the document.

## Syntax (C#)
```csharp
public class FilterElement : Element
```